choimyungchul/r21_Plus_PsrasmTest/rt700_dual_core_low_power_thermometer/armgcc/examples/_boards/mimxrt700evk/lvgl_examples/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPMICPins
 * Description   : Configures pin routing and pin electrical features for PMIC.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPMICPins(void)
{
    /* Reset IOPCTL1 module */
    RESET_ClearPeripheralReset(kIOPCTL1_RST_SHIFT_RSTn);

    IOPCTL1->PMIC_I2C_SCL =
        ((IOPCTL1->PMIC_I2C_SCL &
          /* Mask bits to zero which are setting */
          (~(IOPCTL1_PMIC_I2C_SCL_IBENA_MASK | IOPCTL1_PMIC_I2C_SCL_SLEWRATE_MASK | IOPCTL1_PMIC_I2C_SCL_ODENA_MASK)))

         /* Input Buffer Enable: Enables */
         | IOPCTL1_PMIC_I2C_SCL_IBENA(PMIC_I2C_SCL_IBENA_IBENA_1)

         /* Slew Rate Control: Disables. Standard mode. */
         | IOPCTL1_PMIC_I2C_SCL_SLEWRATE(PMIC_I2C_SCL_SLEWRATE_SLEWRATE_0)

         /* Open-drain Mode Enable: Enables for simulated open-drain output (high drive disabled) */
         | IOPCTL1_PMIC_I2C_SCL_ODENA(PMIC_I2C_SCL_ODENA_ODENA_1));

    IOPCTL1->PMIC_I2C_SDA =
        ((IOPCTL1->PMIC_I2C_SDA &
          /* Mask bits to zero which are setting */
          (~(IOPCTL1_PMIC_I2C_SDA_IBENA_MASK | IOPCTL1_PMIC_I2C_SDA_SLEWRATE_MASK | IOPCTL1_PMIC_I2C_SDA_ODENA_MASK)))

         /* Input Buffer Enable: Enables */
         | IOPCTL1_PMIC_I2C_SDA_IBENA(PMIC_I2C_SDA_IBENA_IBENA_1)

         /* Slew Rate Control: Disables, in standard mode. */
         | IOPCTL1_PMIC_I2C_SDA_SLEWRATE(PMIC_I2C_SDA_SLEWRATE_SLEWRATE_0)

         /* Open-drain Mode Enable: Enables for simulated open-drain output (high drive disabled) */
         | IOPCTL1_PMIC_I2C_SDA_ODENA(PMIC_I2C_SDA_ODENA_ODENA_1));

    const uint32_t port7_pin14_config = (/* Pin is configured as PIO7_14 */
                                         IOPCTL_PIO_FUNC0 |
                                         /* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_DI |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Disable input buffer function */
                                         IOPCTL_PIO_INBUF_DI |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI |
                                         /* Selects transmitter current drive 100ohm */
                                         IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN14 (coords: P14) is configured as PIO7_14 */
    IOPCTL_PinMuxSet(7U, 14U, port7_pin14_config);

    const uint32_t port7_pin15_config = (/* Pin is configured as PIO7_15 */
                                         IOPCTL_PIO_FUNC0 |
                                         /* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_DI |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Disable input buffer function */
                                         IOPCTL_PIO_INBUF_DI |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI |
                                         /* Selects transmitter current drive 100ohm */
                                         IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN15 (coords: M14) is configured as PIO7_15 */
    IOPCTL_PinMuxSet(7U, 15U, port7_pin15_config);

    const uint32_t port7_pin16_config = (/* Pin is configured as PIO7_16 */
                                         IOPCTL_PIO_FUNC0 |
                                         /* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_DI |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Disable input buffer function */
                                         IOPCTL_PIO_INBUF_DI |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI |
                                         /* Selects transmitter current drive 100ohm */
                                         IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN16 (coords: M15) is configured as PIO7_16 */
    IOPCTL_PinMuxSet(7U, 16U, port7_pin16_config);
}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitUserSWPins
 * Description   : Configures pin routing and pin electrical features for User Buttons.
 *
 * END ****************************************************************************************************************/
void BOARD_InitUserSWPins(void)
{
    const uint32_t sw_config = (/* Pin is configured as PIO0_9 */
                                        IOPCTL_PIO_FUNC0 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN9 (coords: L7) is configured as PIO0_9 */
    IOPCTL_PinMuxSet(0U, 9U, sw_config);
    /* PORT1 PIN3 (coords: P6) is configured as PIO1_3 */
    IOPCTL_PinMuxSet(1U, 3U, sw_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
